great-man2096/STM32F103ZET6-TEST/User/main.c
/**
 ******************************************************************************
 * @file     main.c
 * @author   正点原子团队(ALIENTEK)
 * @version  V1.0
 * @date     2020-08-20
 * @brief    新建工程实验-HAL库版本 实验
 * @license  Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ******************************************************************************
 * @attention
 *
 * 实验平台:正点原子 STM32F103 开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 ******************************************************************************
 */
#include "string.h"
#include "math.h"
#include "./SYSTEM/sys/sys.h"
#include "./SYSTEM/usart/usart.h"
#include "./SYSTEM/delay/delay.h"
#include "./BSP/LED/led.h"
#include "./BSP/KEY/key.h"
// #include "./BSP/EXTI/exti.h"
#include "./BSP/WDG/wdg.h"
// #include "./BSP/TIMER/btim.h"
// #include "./BSP/TIMER/gtime.h"
#include "./BSP/TIMER/atim.h"
#include "./BSP/LCD/lcd.h"
#include "./USMART/usmart.h"
#include "./BSP/RTC/rtc.h"
#include "./BSP/PWR/pwr.h"
#include "./BSP/DMA/dma.h"
#include "./BSP/ADC/adc.h"
#include "./BSP/DAC/dac.h"
#include "./BSP/PWMDAC/pwmdac.h"
#include "./BSP/24CXX/24cxx.h"
#include "./BSP/NORFLASH/norflash.h"
#include "./BSP/CAN/can.h"
#include "./BSP/TOUCH/touch.h"
#include "./BSP/NRF24L01/nrf24l01.h"
#include "./BSP/STMFLASH/stmflash.h"
#include "./BSP/SRAM/sram.h"
#include "./MALLOC/malloc.h"
#include "./BSP/SDIO/sdio_sdcard.h"
#include "./FATFS/exfuns/exfuns.h"
#include "./TEXT/fonts.h"
#include "./TEXT/text.h"
#include "./PICTURE/piclib.h"
#include "string.h"
#include "math.h"
#include "./BSP/OLED/oled.h"
#include "./BSP/GUI/GUI_Paint.h"
#include "./TEXT/fonts.h"
#include "./ATKNCR/atk_ncr.h"
#include "./T9INPUT/pyinput.h"
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_cdc.h"
#include "usbd_cdc_interface.h"
#include "usbd_msc.h"
#include "usbd_storage.h"

//	extern uint8_t g_timxchy_cap_sta; //输入捕获状态
//	extern uint16_t g_timxchy_cap_val; //输入捕获值
//	extern uint8_t g_timxchy_pwmin_sta; /* pwm输入状态 */
//	extern uint16_t g_timxchy_pwmin_psc; /* pwm输入分频系数 */
//	extern uint16_t g_timxchy_pwmin_hval;	/* pwm输入高电平脉宽 */
//	extern uint16_t g_timxchy_pwmin_cval;	/* pwm输入周期宽度 */

void led_set(uint8_t sta)
{
	LED1(sta);
}

/* 函数参数调用测试函数 */
void test_fun(void (*ledset)(uint8_t), uint8_t sta)
{
	ledset(sta);
}

// 时钟显示函数
uint8_t tbuf[40];
/* 定义字符数组用于显示周 */
char *weekdays[] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saterday"};
void showtime(void)
{
	rtc_get_time();
	sprintf((char *)tbuf, "Time:%02d:%02d:%02d", calendar.hour, calendar.min, calendar.sec);
	lcd_show_string(30, 160, 210, 16, 16, (char *)tbuf, RED);
	sprintf((char *)tbuf, "Date:%04d-%02d-%02d", calendar.year, calendar.month, calendar.date);
	lcd_show_string(30, 180, 210, 16, 16, (char *)tbuf, RED);
	sprintf((char *)tbuf, "Week:%s", weekdays[calendar.week]);
	lcd_show_string(30, 200, 210, 16, 16, (char *)tbuf, RED);
}

// 单通道ADC过采样（12转16分辨率）用到的参数，如果不放在main函数外会编译失败
//  #define ADC_OVERSAMPLE_TIMES    256                         /* ADC过采样次数, 这里提高4bit分辨率, 需要256倍采样 */
//  #define ADC_DMA_BUF_SIZE        ADC_OVERSAMPLE_TIMES * 10   /* ADC DMA采集 BUF大小, 应等于过采样次数的整数倍 */
//  uint16_t g_adc_dma_buf[ADC_DMA_BUF_SIZE];                   /* ADC DMA BUF */
//  extern uint8_t g_adc_dma_sta;                               /* DMA传输状态标志, 0,未完成; 1, 已完成 */
// extern uint16_t g_dac_sin_buf[4096];
/* 要写入到FLASH的字符串数组 */
// const uint8_t g_text_buf[] = {"STM32 SPI TEST"};	//const,表示它是一个不可变的常量

// #define TEXT_SIZE sizeof(g_text_buf) /* TEXT字符串长度 */
// /* 要写入到STM32 FLASH的字符串数组 */
// const uint8_t g_text_buf[] = {"STM32 FLASH TEST"};
// #define TEXT_LENTH sizeof(g_text_buf) /* 数组长度 */
// /*SIZE表示半字长(2字节), 大小必须是2的整数倍, 如果不是的话, 强制对齐到2的整数倍 */
// #define SIZE TEXT_LENTH / 2 + ((TEXT_LENTH % 2) ? 1 : 0)
// #define FLASH_SAVE_ADDR 0X08010000 /* 设置FLASH 保存地址(必须为偶数，且其值要大于本代码所占用FLASH的大小（Code+RO-data+RW-data） + 0X08000000) */

// const char *SRAM_NAME_BUF[SRAMBANK] = {" SRAMIN ", " SRAMEX "};
/* 最大记录的轨迹点数(输入数据) */
// atk_ncr_point ncr_input_buf[200];
// extern uint16_t kbdxsize;  /* 虚拟键盘按键宽度 */
// extern uint16_t kbdysize;  /* 虚拟键盘按键高度 */

USBD_HandleTypeDef USBD_Device;             /* USB Device处理结构体 */
extern volatile uint8_t g_device_state;     /* USB连接 情况 */
extern volatile uint8_t g_usb_state_reg;    /* USB状态 */

int main(void)
{
	HAL_Init();							/* 初始化HAL库 */
	sys_stm32_clock_init(RCC_PLL_MUL9); /* 设置时钟, 72Mhz */
	delay_init(72);						/* 延时初始化 */
	usart_init(115200);					/* 串口初始化为 115200 */
	led_init();							/* LED初始化 */
	usmart_dev.init(72);				/* USMART初始化 */
	key_init();							/* 初始化按键 */
	rtc_init();							// RTC初始化
	lcd_init();							/* LCD初始化 */

	tp_dev.init();              		/* 初始化触摸屏 */
	my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */
	// norflash_init();            		/* 初始化NORFLASH */
	exfuns_init();                      /* 为fatfs相关变量申请内存 */
	f_mount(fs[0], "0:", 1);            /* 挂载SD卡 */
	f_mount(fs[1], "1:", 1);            /* 挂载FLASH */

	/******************************************************
	USB 读卡器实验
	*******************************************************/
    uint8_t offline_cnt = 0;
    uint8_t tct = 0;
    uint8_t usb_sta;
    uint8_t device_sta;
    uint16_t id;
	lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
    lcd_show_string(30, 70, 200, 16, 16, "USB Card Reader TEST", RED);
    lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);

    if (sd_init())  /* 初始化SD卡 */
    {
        lcd_show_string(30, 110, 200, 16, 16, "SD Card Error!", RED);   /* 检测SD卡错误 */
    }
    else     /* SD 卡正常 */
    {
        lcd_show_string(30, 110, 200, 16, 16, "SD Card Size:     MB", RED);
        lcd_show_num(134, 110, SD_TOTAL_SIZE_MB(&g_sdcard_handler), 5, 16, RED);  /* 显示SD卡容量 */
    }

    id = norflash_read_id();
    if ((id == 0) || (id == 0XFFFF))
    {
        lcd_show_string(30, 110, 200, 16, 16, "NorFlash Error!", RED);  /* 检测NorFlash错误 */
    }
    else   /* SPI FLASH 正常 */
    {
        lcd_show_string(30, 130, 200, 16, 16, "SPI FLASH Size:12MB", RED);
    }

    usbd_port_config(0);    /* USB先断开 */
    delay_ms(500);
    usbd_port_config(1);    /* USB再次连接 */
    delay_ms(500);

    lcd_show_string(30, 170, 200, 16, 16, "USB Connecting...", RED);    /* 提示正在建立连接 */
    USBD_Init(&USBD_Device, &MSC_Desc, 0);                      /* 初始化USB */
    USBD_RegisterClass(&USBD_Device, USBD_MSC_CLASS);           /* 添加类 */
    USBD_MSC_RegisterStorage(&USBD_Device, &USBD_DISK_fops);    /* 为MSC类添加回调函数 */
    USBD_Start(&USBD_Device);                                   /* 开启USB */
    delay_ms(1800);

    while (1)
    {
        delay_ms(1);

