great-man2096/STM32F103ZET6-TEST/User/main.c
        if (usb_sta != g_usb_state_reg)   /* 状态改变了 */
        {
            lcd_fill(30, 190, 240, 210 + 16, WHITE); /* 清除显示 */

            if (g_usb_state_reg & 0x01)   /* 正在写 */
            {
                LED1(0);
                lcd_show_string(30, 190, 200, 16, 16, "USB Writing...", RED); /* 提示USB正在写入数据 */
            }

            if (g_usb_state_reg & 0x02)   /* 正在读 */
            {
                LED1(0);
                lcd_show_string(30, 190, 200, 16, 16, "USB Reading...", RED); /* 提示USB正在读出数据 */
            }

            if (g_usb_state_reg & 0x04)
            {
                lcd_show_string(30, 210, 200, 16, 16, "USB Write Err ", RED); /* 提示写入错误 */
            }
            else
            {
                lcd_fill(30, 210, 240, 230 + 16, WHITE); /* 清除显示 */
            }
            
            if (g_usb_state_reg & 0x08)
            {
                lcd_show_string(30, 230, 200, 16, 16, "USB Read  Err ", RED); /* 提示读出错误 */
            }
            else
            {
                lcd_fill(30, 230, 240, 250 + 16, WHITE); /* 清除显示 */
            }
            
            usb_sta = g_usb_state_reg; /* 记录最后的状态 */
        }

        if (device_sta != g_device_state)
        {
            if (g_device_state == 1)
            {
                lcd_show_string(30, 170, 200, 16, 16, "USB Connected    ", RED);    /* 提示USB连接已经建立 */
            }
            else
            {
                lcd_show_string(30, 170, 200, 16, 16, "USB DisConnected ", RED);    /* 提示USB被拔出了 */
            }
            
            device_sta = g_device_state;
        }

        tct++;

        if (tct == 200)
        {
            tct = 0;
            LED1(1);        /* 关闭 LED1 */
            LED0_TOGGLE();  /* LED0 闪烁 */

            if (g_usb_state_reg & 0x10)
            {
                offline_cnt = 0;    /* USB连接了,则清除offline计数器 */
                g_device_state = 1;
            }
            else    /* 没有得到轮询 */
            {
                offline_cnt++;

                if (offline_cnt > 100)
                {
                    g_device_state = 0;/* 20s内没收到在线标记,代表USB被拔出了 */
                }
            }

            g_usb_state_reg = 0;
        }
    }

	/******************************************************
	USB 虚拟串口实验
	*******************************************************/
	// uint16_t len;
    // uint16_t times = 0;
    // uint8_t usbstatus = 0;
	// lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30, 70, 200, 16, 16, "USB Virtual USART TEST", RED);
    // lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "USB Connecting...", RED); /* 提示USB开始连接 */

    // usbd_port_config(0);    /* USB先断开 */
    // delay_ms(500);
    // usbd_port_config(1);    /* USB再次连接 */
    // delay_ms(500);

    // USBD_Init(&USBD_Device, &VCP_Desc, 0);
    // USBD_RegisterClass(&USBD_Device, USBD_CDC_CLASS);
    // USBD_CDC_RegisterInterface(&USBD_Device, &USBD_CDC_fops);
    // USBD_Start(&USBD_Device);

    // while (1)
    // {
    //     if (usbstatus != g_device_state)   /* USB连接状态发生了改变 */
    //     {
    //         usbstatus = g_device_state; /* 记录新的状态 */

    //         if (usbstatus == 1)
    //         {
    //             lcd_show_string(30, 110, 200, 16, 16, "USB Connected    ", RED); /* 提示USB连接成功 */
    //             LED1(0);    /* 绿灯亮 */
    //         }
    //         else
    //         {
    //             lcd_show_string(30, 110, 200, 16, 16, "USB disConnected ", RED); /* 提示USB断开 */
    //             LED1(1);    /* 绿灯灭 */
    //         }
    //     }

    //     if (g_usb_usart_rx_sta & 0x8000)
    //     {
    //         len = g_usb_usart_rx_sta & 0x3FFF;  /* 得到此次接收到的数据长度 */
    //         usb_printf("\r\n您发送的消息长度为:%d\r\n\r\n", len);
    //         cdc_vcp_data_tx(g_usb_usart_rx_buffer, len);;
    //         usb_printf("\r\n\r\n");/* 插入换行 */
    //         g_usb_usart_rx_sta = 0;
    //     }
    //     else
    //     {
    //         times++;

    //         if (times % 5000 == 0)
    //         {
    //             usb_printf("\r\nSTM32开发板USB虚拟串口实验\r\n");
    //             usb_printf("正点原子@ALIENTEK\r\n\r\n");
    //         }

    //         if (times % 200 == 0)usb_printf("请输入数据,以回车键结束\r\n");

    //         if (times % 30 == 0)
    //         {
    //             LED0_TOGGLE();  /* 闪烁LED,提示系统正在运行 */
    //         }
            
    //         delay_ms(10);
    //     }
    // }
	/******************************************************
	T9 拼音输入法实验
	*******************************************************/
// 	uint8_t i = 0;
//     uint8_t result_num;
//     uint8_t cur_index;
//     uint8_t key;
//     uint8_t temp;
//     uint8_t inputstr[7];                        /* 最大输入6个字符+结束符 */
//     uint8_t inputlen;                           /* 输入长度 */
    
// RESTART:
//     while (fonts_init())                        /* 检查字库 */
//     {
//         lcd_show_string(60, 50, 200, 16, 16, "Font Error!", RED);
//         delay_ms(200);
//         lcd_fill(60, 50, 240, 66, WHITE);   /* 清除显示 */
//         delay_ms(200);
//     }

//     text_show_string(30, 5, 200, 16, "正点原子STM32开发板", 16, 0, RED);
//     text_show_string(30, 25, 200, 16, "拼音输入法实验", 16, 0, RED);
//     text_show_string(30, 45, 200, 16, "正点原子@ALIENTEK", 16, 0, RED);
//     text_show_string(30, 65, 200, 16, "KEY_UP:校准", 16, 0, RED);
//     text_show_string(30, 85, 200, 16, "KEY0:翻页  KEY1:清除", 16, 0, RED);
//     text_show_string(30, 105, 200, 16, "输入:        匹配:  ", 16, 0, RED);
//     text_show_string(30, 125, 200, 16, "拼音:        当前:  ", 16, 0, RED);
//     text_show_string(30, 145, 210, 32, "结果:", 16, 0, RED);

//     /* 根据LCD分辨率设置按键大小 */
//     if (lcddev.id == 0X5310)
//     {
//         kbdxsize = 86;    
//         kbdysize = 43;
//     }
//     else if (lcddev.id == 0X5510)
//     {
//         kbdxsize = 140;
//         kbdysize = 70;
//     }
//     else
//     {
//         kbdxsize = 60;
//         kbdysize = 40;
//     }

//     py_load_ui(30, 195);
//     my_mem_set(inputstr, 0, 7); /* 全部清零 */
//     inputlen = 0;   /* 输入长度为0 */
//     result_num = 0; /* 总匹配数清零 */
//     cur_index = 0;

//     while (1)
//     {
//         i++;
//         delay_ms(10);
//         key = py_get_keynum(30, 195);

//         if (key)
//         {
//             if (key == 1)   /* 删除 */
//             {
//                 if (inputlen)inputlen--;

//                 inputstr[inputlen] = '\0';      /* 添加结束符 */
//             }
//             else
//             {
//                 inputstr[inputlen] = key + '0'; /* 输入字符 */

//                 if (inputlen < 7)inputlen++;
//             }

//             if (inputstr[0] != NULL)
//             {
//                 temp = t9.getpymb(inputstr);     /* 得到匹配的结果数 */

//                 if (temp)   /* 有部分匹配/完全匹配的结果 */
//                 {
//                     result_num = temp & 0X7F;   /* 总匹配结果 */
//                     cur_index = 1;              /* 当前为第一个索引 */

//                     if (temp & 0X80)            /* 是部分匹配 */
//                     {
//                         inputlen = temp & 0X7F; /* 有效匹配位数 */
//                         inputstr[inputlen] = '\0';  /* 不匹配的位数去掉 */

//                         if (inputlen > 1)
//                         {
//                             temp = t9.getpymb(inputstr);    /* 重新获取完全匹配字符数 */
//                             result_num = (temp & 0X80)? 0 : (temp & 0X7F); /* 如果还是部分匹配, 直接匹配数为0, 否则表示匹配数量 */
//                         }
//                     }
//                 }
//                 else    /* 没有任何匹配 */
//                 {
//                     inputlen--;
//                     inputstr[inputlen] = '\0';
//                 }
//             }
//             else
//             {
//                 cur_index = 0;
//                 result_num = 0;
//             }

