great-man2096/STM32F103ZET6-TEST/User/main.c
	// printf("OLED Init...\r\n");
	// OLED_Init();
	// delay_ms(500);	
	// // 0.Create a new image cache
	// UBYTE *BlackImage;
	// UWORD Imagesize = ((OLED_1IN3_WIDTH%8==0)? (OLED_1IN3_WIDTH/8): (OLED_1IN3_WIDTH/8+1)) * OLED_1IN3_HEIGHT;
	// BlackImage = (UBYTE *)mymalloc(SRAMIN,Imagesize);
	// printf("Paint_NewImage\r\n");
	// Paint_NewImage(BlackImage, OLED_1IN3_WIDTH, OLED_1IN3_HEIGHT, 90, BLACK);	

	// printf("Drawing\r\n");
	// //1.Select Image
	// Paint_SelectImage(BlackImage);
	// delay_ms(500);
	// Paint_Clear(BLACK);
	// while(1) {
		
	// 	// 2.Drawing on the image		
	// 	printf("Drawing:page 1\r\n");
	// 	Paint_DrawPoint(20, 10, WHITE, DOT_PIXEL_1X1, DOT_STYLE_DFT);
	// 	Paint_DrawPoint(30, 10, WHITE, DOT_PIXEL_2X2, DOT_STYLE_DFT);
	// 	Paint_DrawPoint(40, 10, WHITE, DOT_PIXEL_3X3, DOT_STYLE_DFT);
	// 	Paint_DrawLine(10, 10, 10, 20, WHITE, DOT_PIXEL_1X1, LINE_STYLE_SOLID);
	// 	Paint_DrawLine(20, 20, 20, 30, WHITE, DOT_PIXEL_1X1, LINE_STYLE_SOLID);
	// 	Paint_DrawLine(30, 30, 30, 40, WHITE, DOT_PIXEL_1X1, LINE_STYLE_DOTTED);
	// 	Paint_DrawLine(40, 40, 40, 50, WHITE, DOT_PIXEL_1X1, LINE_STYLE_DOTTED);
	// 	Paint_DrawCircle(60, 30, 15, WHITE, DOT_PIXEL_1X1, DRAW_FILL_EMPTY);
	// 	Paint_DrawCircle(100, 40, 20, WHITE, DOT_PIXEL_1X1, DRAW_FILL_FULL);			
	// 	Paint_DrawRectangle(50, 30, 60, 40, WHITE, DOT_PIXEL_1X1, DRAW_FILL_EMPTY);
	// 	Paint_DrawRectangle(90, 30, 110, 50, BLACK, DOT_PIXEL_1X1, DRAW_FILL_FULL);		
	// 	// 3.Show image on page1
	// 	OLED_1IN3_Display(BlackImage);
	// 	delay_ms(2000);			
	// 	Paint_Clear(BLACK);
		
	// 	// Drawing on the image
	// 	printf("Drawing:page 2\r\n");			
	// 	Paint_DrawString_EN(10, 0, "waveshare", &Font16, WHITE, WHITE);
	// 	Paint_DrawString_EN(10, 17, "hello world", &Font8, WHITE, WHITE);
	// 	Paint_DrawNum(10, 30, 123.456789, &Font8, 4, WHITE, WHITE);
	// 	Paint_DrawNum(10, 43, 987654, &Font12, 5, WHITE, WHITE);
	// 	// Show image on page2
	// 	OLED_1IN3_Display(BlackImage);
	// 	delay_ms(2000);	
	// 	Paint_Clear(BLACK);		
		
	// 	// Drawing on the image
	// 	printf("Drawing:page 3\r\n");
	// 	Paint_DrawString_CN(10, 0,"杨世昌", &Font12CN, WHITE, WHITE);
	// 	Paint_DrawString_CN(0, 20, "你好 世界", &Font24CN, WHITE, WHITE);
	// 	// Show image on page3
	// 	OLED_1IN3_Display(BlackImage);
	// 	delay_ms(2000);		
	// 	Paint_Clear(BLACK);	

	// 	// Drawing on the image
	// 	printf("Drawing:page 4\r\n");
	// 	OLED_1IN3_Display(gImage_1in3);
	// 	delay_ms(2000);		
	// 	Paint_Clear(BLACK);	

	// }

	/******************************************************
	图片显示实验
	*******************************************************/
	// uint8_t res;
    // DIR picdir;           /* 图片目录 */
    // FILINFO *picfileinfo; /* 文件信息 */
    // char *pname;          /* 带路径的文件名 */
    // uint16_t totpicnum;   /* 图片文件总数 */
    // uint16_t curindex;    /* 图片当前索引 */
    // uint8_t pause = 0;    /* 暂停标记 */
    // uint8_t t;
    // uint16_t temp;
    // uint32_t *picoffsettbl; /* 图片文件offset索引表 */
	// exfuns_init();           /* 为fatfs相关变量申请内存 */
    // f_mount(fs[0], "0:", 1); /* 挂载SD卡 */
    // f_mount(fs[1], "1:", 1); /* 挂载FLASH */

    // while (fonts_init()) /* 检查字库 */
    // {
    //     lcd_show_string(30, 50, 200, 16, 16, "Font Error!", RED);
    //     delay_ms(200);
    //     lcd_fill(30, 50, 240, 66, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // text_show_string(30,  50, 200, 16, "正点原子STM32开发板", 16, 0, RED);
    // text_show_string(30,  70, 200, 16, "图片显示 实验", 16, 0, RED);
    // text_show_string(30,  90, 200, 16, "KEY0:NEXT KEY1:PREV", 16, 0, RED);
    // text_show_string(30, 110, 200, 16, "KEY_UP:PAUSE", 16, 0, RED);
    // text_show_string(30, 130, 200, 16, "正点原子@ALIENTEK", 16, 0, RED);

    // while (f_opendir(&picdir, "0:/PICTURE")) /* 打开图片文件夹 */
    // {
    //     text_show_string(30, 150, 240, 16, "PICTURE文件夹错误!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // totpicnum = pic_get_tnum("0:/PICTURE"); /* 得到总有效文件数 */

    // while (totpicnum == NULL) /* 图片文件为0 */
    // {
    //     text_show_string(30, 150, 240, 16, "没有图片文件!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // picfileinfo = (FILINFO *)mymalloc(SRAMIN, sizeof(FILINFO)); /* 申请内存 */
    // pname = mymalloc(SRAMIN, FF_MAX_LFN * 2 + 1);               /* 为带路径的文件名分配内存 */
    // picoffsettbl = mymalloc(SRAMIN, 4 * totpicnum);             /* 申请4*totpicnum个字节的内存,用于存放图片索引 */

    // while (!picfileinfo || !pname || !picoffsettbl) /* 内存分配出错 */
    // {
    //     text_show_string(30, 150, 240, 16, "内存分配失败!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // /* 记录索引 */
    // res = f_opendir(&picdir, "0:/PICTURE"); /* 打开目录 */

    // if (res == FR_OK)
    // {
    //     curindex = 0; /* 当前索引为0 */

    //     while (1) /* 全部查询一遍 */
    //     {
    //         temp = picdir.dptr;                    /* 记录当前dptr偏移 */
    //         res = f_readdir(&picdir, picfileinfo); /* 读取目录下的一个文件 */

    //         if (res != FR_OK || picfileinfo->fname[0] == 0)
    //             break; /* 错误了/到末尾了,退出 */

    //         res = exfuns_file_type(picfileinfo->fname);

    //         if ((res & 0XF0) == 0X50) /* 取高四位,看看是不是图片文件 */
    //         {
    //             picoffsettbl[curindex] = temp; /* 记录索引 */
    //             curindex++;
    //         }
    //     }
    // }

    // text_show_string(30, 150, 240, 16, "开始显示...", 16, 0, RED);
    // delay_ms(1500);
    // piclib_init();                                         /* 初始化画图 */
    // curindex = 0;                                          /* 从0开始显示 */
    // res = f_opendir(&picdir, (const TCHAR *)"0:/PICTURE"); /* 打开目录 */

    // while (res == FR_OK) /* 打开成功 */
    // {
    //     dir_sdi(&picdir, picoffsettbl[curindex]); /* 改变当前目录索引 */
    //     res = f_readdir(&picdir, picfileinfo);    /* 读取目录下的一个文件 */

