great-man2096/STM32F103ZET6-TEST/User/main.c
    //     if (res != FR_OK || picfileinfo->fname[0] == 0)
    //         break; /* 错误了/到末尾了,退出 */

    //     strcpy((char *)pname, "0:/PICTURE/");                    /* 复制路径(目录) */
    //     strcat((char *)pname, (const char *)picfileinfo->fname); /* 将文件名接在后面 */
    //     lcd_clear(BLACK);
    //     piclib_ai_load_picfile(pname, 0, 0, lcddev.width, lcddev.height, 1); /* 显示图片 */
    //     text_show_string(2, 2, lcddev.width, 16, (char *)pname, 16, 1, RED); /* 显示图片名字 */
    //     t = 0;

    //     while (1)
    //     {
    //         if (t > 250)/* 模拟一次按下KEY0 */
	// 		{
	// 			curindex++;

	// 			if (curindex >= totpicnum)
	// 				curindex = 0; /* 到末尾的时候,自动从头开始 */

	// 			break; 
	// 		}

    //         if ((t % 20) == 0)
    //         {
    //             LED0_TOGGLE(); /* LED0闪烁,提示程序正在运行. */
    //         }

    //         if (key2_scan()) /* 上一张 */
    //         {
    //             if (curindex)
    //             {
    //                 curindex--;
    //             }
    //             else
    //             {
    //                 curindex = totpicnum - 1;
    //             }

    //             break;
    //         }
    //         else if (key1_scan()) /* 下一张 */
    //         {
    //             curindex++;

    //             if (curindex >= totpicnum)
    //                 curindex = 0; /* 到末尾的时候,自动从头开始 */

    //             break;
    //         }
    //         else if (key4_scan())
    //         {
    //             pause = !pause;
    //             LED1(!pause); /* 暂停的时候LED1亮. */
    //         }

    //         if (pause == 0)
    //             t++;

    //         delay_ms(10);
    //     }

    //     res = 0;
    // }

    // myfree(SRAMIN, picfileinfo);  /* 释放内存 */
    // myfree(SRAMIN, pname);        /* 释放内存 */
    // myfree(SRAMIN, picoffsettbl); /* 释放内存 */

	/******************************************************
	汉字显示实验
	*******************************************************/
	// uint32_t fontcnt;
    // uint8_t i, j;
    // uint8_t fontx[2]; /* GBK码 */
    // uint8_t key, t;

	// exfuns_init();                      /* 为fatfs相关变量申请内存 */
    // f_mount(fs[0], "0:", 1);            /* 挂载SD卡 */
    // f_mount(fs[1], "1:", 1);            /* 挂载FLASH */

    // while (fonts_init())                /* 检查字库 */
    // {
    // UPD:
    //     lcd_clear(WHITE);               /* 清屏 */
    //     lcd_show_string(30, 30, 200, 16, 16, "STM32", RED);

    //     while (sd_init())               /* 检测SD卡 */
    //     {
    //         lcd_show_string(30, 50, 200, 16, 16, "SD Card Failed!", RED);
    //         delay_ms(200);
    //         lcd_fill(30, 50, 200 + 30, 50 + 16, WHITE);
    //         delay_ms(200);
    //     }

    //     lcd_show_string(30, 50, 200, 16, 16, "SD Card OK", RED);
    //     lcd_show_string(30, 70, 200, 16, 16, "Font Updating...", RED);
    //     key = fonts_update_font(20, 90, 16, (uint8_t *)"0:", RED); /* 更新字库 */

    //     while (key) /* 更新失败 */
    //     {
    //         lcd_show_string(30, 90, 200, 16, 16, "Font Update Failed!", RED);
    //         delay_ms(200);
    //         lcd_fill(20, 90, 200 + 20, 90 + 16, WHITE);
    //         delay_ms(200);
    //     }

    //     lcd_show_string(30, 90, 200, 16, 16, "Font Update Success!   ", RED);
    //     delay_ms(1500);
    //     lcd_clear(WHITE); /* 清屏 */
    // }

    // text_show_string(30, 30, 200, 16, "正点原子STM32开发板", 16, 0, RED);
    // text_show_string(30, 50, 200, 16, "GBK字库测试程序", 16, 0, RED);
    // text_show_string(30, 70, 200, 16, "正点原子@ALIENTEK", 16, 0, RED);
    // text_show_string(30, 90, 200, 16, "按KEY0,更新字库", 16, 0, RED);
    
    
    // text_show_string(30, 110, 200, 16, "内码高字节:", 16, 0, BLUE);
    // text_show_string(30, 130, 200, 16, "内码低字节:", 16, 0, BLUE);
    // text_show_string(30, 150, 200, 16, "汉字计数器:", 16, 0, BLUE);
    
    // text_show_string(30, 180, 200, 24, "对应汉字为:", 24, 0, BLUE);
    // text_show_string(30, 204, 200, 16, "对应汉字(16*16)为:", 16, 0, BLUE);
    // text_show_string(30, 220, 200, 16, "对应汉字(12*12)为:", 12, 0, BLUE);

    // while (1)
    // {
    //     fontcnt = 0;

    //     for (i = 0x81; i < 0xff; i++) /* GBK内码高字节范围为0X81~0XFE */
    //     {
    //         fontx[0] = i;
    //         lcd_show_num(118, 110, i, 3, 16, BLUE); /* 显示内码高字节 */

    //         for (j = 0x40; j < 0xfe; j++) /* GBK内码低字节范围为 0X40~0X7E, 0X80~0XFE) */
    //         {
    //             if (j == 0x7f)
    //                 continue;

    //             fontcnt++;
    //             lcd_show_num(118, 130, j, 3, 16, BLUE);       /* 显示内码低字节 */
    //             lcd_show_num(118, 150, fontcnt, 5, 16, BLUE); /* 汉字计数显示 */
    //             fontx[1] = j;
    //             text_show_font(30 + 132, 180, fontx, 24, 0, BLUE);
    //             text_show_font(30 + 144, 204, fontx, 16, 0, BLUE);
    //             text_show_font(30 + 108, 220, fontx, 12, 0, BLUE);
    //             t = 200;

    //             while (t--) /* 延时,同时扫描按键 */
    //             {
    //                 delay_ms(1);

    //                 if (key1_scan())
    //                 {
    //                     goto UPD; /* 跳转到UPD位置(强制更新字库) */
    //                 }
    //             }

    //             LED0_TOGGLE();
    //         }
    //     }
    // }

	/******************************************************
	FATFS实验
	*******************************************************/
	// uint32_t total, free;
    // uint8_t t = 0;
    // uint8_t res = 0;
    // my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */

    // lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "FATFS TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "Use USMART for test", RED);

    // while (sd_init()) /* 检测不到SD卡 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Error!", RED);
    //     delay_ms(500);
    //     lcd_show_string(30, 130, 200, 16, 16, "Please Check! ", RED);
    //     delay_ms(500);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

    // exfuns_init();                 /* 为fatfs相关变量申请内存 */
	
    // f_mount(fs[0], "0:", 1);       /* 挂载SD卡 */
    // res = f_mount(fs[1], "1:", 1); /* 挂载FLASH. */

