great-man2096/STM32F103ZET6-TEST/User/main.c
    // if (res == 0X0D) /* FLASH磁盘,FAT文件系统错误,重新格式化FLASH */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Formatting...", RED); /* 格式化FLASH */
    //     res = f_mkfs("1:", 0, 0, FF_MAX_SS);                                    /* 格式化FLASH,1:,盘符;0,使用默认格式化参数 */

    //     if (res == 0)
    //     {
    //         f_setlabel((const TCHAR *)"1:ALIENTEK");                                /* 设置Flash磁盘的名字为：ALIENTEK */
    //         lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Format Finish", RED); /* 格式化完成 */
    //     }
    //     else
    //         lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Format Error ", RED); /* 格式化失败 */

    //     delay_ms(1000);
    // }

    // lcd_fill(30, 130, 240, 150 + 16, WHITE); /* 清除显示 */

    // while (exfuns_get_free((uint8_t*)"0", &total, &free)) /* 得到SD卡的总容量和剩余容量 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Fatfs Error!", RED);
    //     delay_ms(200);
    //     lcd_fill(30, 130, 240, 150 + 16, WHITE); /* 清除显示 */
    //     delay_ms(200);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

    // lcd_show_string(30, 130, 200, 16, 16, "FATFS OK!", BLUE);
    // lcd_show_string(30, 150, 200, 16, 16, "SD Total Size:     MB", BLUE);
    // lcd_show_string(30, 170, 200, 16, 16, "SD  Free Size:     MB", BLUE);
    // lcd_show_num(30 + 8 * 14, 150, total >> 10, 5, 16, BLUE); /* 显示SD卡总容量 MB */
    // lcd_show_num(30 + 8 * 14, 170, free >> 10, 5, 16, BLUE);  /* 显示SD卡剩余容量 MB */

	// /* 测试代码 */
	// // FIL fil;
	// // FRESULT mres;
	// // UINT bww;
	// // char buff[50];
	// // mres = f_open(&fil,"0:/test/MyNewFile.txt",FA_CREATE_ALWAYS|FA_WRITE);	//创建并进入写模式
	// // printf("open/FA_CREATE_ALWAYS|FA_WRITE:%d\r\n",mres);
	// // mres = f_write(&fil,"ysc yyds",50,&bww);
	// // printf("write:%d\r\n",mres);
	// // f_close(&fil);
	// // mres = f_open(&fil,"0:/test/MyNewFile.txt",FA_READ);
	// // printf("open/FA_READ:%d\r\n",mres);
	// // mres = f_read(&fil,&buff,50,&bww);
	// // printf("read:%d\r\n",mres);
	// // f_close(&fil);
	// // printf("%c",buff);
	// // lcd_show_string(30, 200, 210, 16, 16, (char *)buff, RED);

    // while (1)
    // {
    //     t++;
    //     delay_ms(200);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

	/******************************************************
	SD卡实验
	*******************************************************/
	// uint8_t t = 0;

	// my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */

	// lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "SD TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "KEY0:Read Sector 0", RED);

    // while (sd_init()) /* 检测不到SD卡 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Error!", RED);
    //     delay_ms(500);
    //     lcd_show_string(30, 130, 200, 16, 16, "Please Check! ", RED);
    //     delay_ms(500);
    //     LED0_TOGGLE(); /* 红灯闪烁 */
    // }

    // /* 打印SD卡相关信息 */
    // show_sdcard_info();

    // /* 检测SD卡成功 */
    // lcd_show_string(30, 130, 200, 16, 16, "SD Card OK    ", BLUE);
    // lcd_show_string(30, 150, 200, 16, 16, "SD Card Size:     GB", BLUE);
    // lcd_show_num(30 + 13 * 8, 150, SD_TOTAL_SIZE_GB(&g_sdcard_handler), 5, 16, BLUE); /* 显示SD卡容量 */

    // while (1)
    // {

    //     if (key1_scan())   /* KEY0按下了 */
    //     {
    //         sd_test_read(0, 1); /* 从0扇区读取1*512字节的内容 */
    //     }

    //     t++;
    //     delay_ms(10);

    //     if (t == 20)
    //     {
    //         LED0_TOGGLE(); /* 红灯闪烁 */
    //         t = 0;
    //     }
    // }

	/******************************************************
	内存管理实验
	*******************************************************/	
	// uint8_t paddr[20];  /* 存放P Addr:+p地址的ASCII值 */
    // uint16_t memused = 0;
    // uint8_t i = 0;
    // uint8_t *p = 0;
    // uint8_t *tp = 0;
    // uint8_t sramx = 0;  /* 默认为内部sram */
	// // sram_init();                        /* SRAM初始化 */
    // my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */
    // // my_mem_init(SRAMEX);                /* 初始化外部SRAM内存池 */

    // lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "MALLOC TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "KEY0:Malloc & WR & Show", RED);
    // lcd_show_string(30, 130, 200, 16, 16, "KEY_UP:SRAMx KEY1:Free", RED);
    // lcd_show_string(60, 160, 200, 16, 16, " SRAMIN ", BLUE);
    // lcd_show_string(30, 176, 200, 16, 16, "SRAMIN   USED:", BLUE);
    // lcd_show_string(30, 192, 200, 16, 16, "SRAMEX   USED:", BLUE);

	// while (1)
	// {
	// 	if (key2_scan()) /* KEY0按下 */
	// 	{
	// 		printf("E0按下\r\n");
	// 		p = mymalloc(sramx, 2048); /* 申请2K字节,并写入内容,显示在lcd屏幕上面 */
	// 		printf("P Addr:0X%08X\r\n", p);
	// 		if (p != NULL)
	// 		{
	// 			printf("p != null\r\n");
	// 			sprintf((char *)p, "Memory Malloc Test%03d", i);		/* 向p写入一些内容 */
	// 			lcd_show_string(30, 260, 209, 16, 16, (char *)p, BLUE); /* 显示P的内容 */
	// 			printf("显示P的内容结束\r\n");
	// 		}
	// 	}

	// 	if (key1_scan()) /* KEY1按下 */
	// 	{
	// 		printf("C13按下\r\n");
	// 		myfree(sramx, p); /* 释放内存 */
	// 		p = 0;			  /* 指向空地址 */
	// 	}

	// 	if (key4_scan()) /* KEY UP按下 */
	// 	{
	// 		printf("A0按下\r\n");
	// 		sramx++;

	// 		if (sramx > 1)
	// 			sramx = 0;

	// 		lcd_show_string(60, 160, 200, 16, 16, (char *)SRAM_NAME_BUF[sramx], BLUE);
	// 	}

	// 	if (tp != p)
	// 	{
	// 		tp = p;
	// 		sprintf((char *)paddr, "P Addr:0X%08X", (uint32_t)tp);
	// 		lcd_show_string(30, 240, 209, 16, 16, (char *)paddr, BLUE); /* 显示p的地址 */

	// 		if (p)
	// 		{
	// 			lcd_show_string(30, 260, 280, 16, 16, (char *)p, BLUE); /* 显示P的内容 */
	// 		}
	// 		else
	// 		{
	// 			lcd_fill(30, 260, 209, 296, WHITE); /* p=0,清除显示 */
	// 		}
	// 	}

	// 	delay_ms(10);
	// 	i++;

	// 	if ((i % 20) == 0)
	// 	{
	// 		memused = my_mem_perused(SRAMIN);
	// 		sprintf((char *)paddr, "%d.%01d%%", memused / 10, memused % 10);
	// 		lcd_show_string(30 + 112, 176, 200, 16, 16, (char *)paddr, BLUE); /* 显示内部内存使用率 */

