great-man2096/STM32F103ZET6-TEST/User/main.c
	// 	temp -= adcx;
	// 	temp *= 1000;
	// 	lcd_show_xnum(110, 150, temp, 3, 16, 0X80, BLUE); /* 显示电压值的小数部分 */

	// 	adcx = adc_get_result();		   /* 得到ADC1通道2的转换结果 */
	// 	temp = (float)adcx * (3.3 / 4096); /* 得到ADC电压值(adc是12bit的) */
	// 	adcx = temp;
	// 	lcd_show_xnum(94, 170, temp, 1, 16, 0, BLUE); /* 显示电压值整数部分 */

	// 	temp -= adcx;
	// 	temp *= 1000;
	// 	lcd_show_xnum(110, 170, temp, 3, 16, 0X80, BLUE); /* 显示电压值的小数部分 */

	// 	if (t == 40) /* 定时时间到了 */
	// 	{
	// 		LED0_TOGGLE(); /* LED0闪烁 */
	// 		t = 0;
	// 	}

	// 	delay_ms(5);
	// }

	/******************************************************
	DAC实验,三角波实验
	*******************************************************/
	// dac_init(1);                        /* 初始化DAC1_OUT1通道 */
	// uint8_t t = 0;
	// lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30,  70, 200, 16, 16, "DAC Triangular WAVE TEST", RED);
	// lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "KEY0:Wave1  KEY1:Wave2", RED);
	// lcd_show_string(30, 130, 200, 16, 16, "DAC None", BLUE); /* 提示无输出 */

	// while (1)
	// {
	//     t++;

	//     if (key1_scan())                        /* 高采样率 , 约1Khz波形 */
	//     {
	//         lcd_show_string(30, 130, 200, 16, 16, "DAC Wave1 ", BLUE);
	//         dac_triangular_wave(4095, 5, 2000, 100); /* 幅值4095, 采样点间隔5us, 200个采样点, 100个波形 */
	//         lcd_show_string(30, 130, 200, 16, 16, "DAC None  ", BLUE);
	//     }
	//     else if (key2_scan())                   /* 低采样率 , 约1Khz波形 */
	//     {
	//         lcd_show_string(30, 130, 200, 16, 16, "DAC Wave2 ", BLUE);
	//         dac_triangular_wave(4095, 500, 20, 100); /* 幅值4095, 采样点间隔500us, 20个采样点, 100个波形 */
	//         lcd_show_string(30, 130, 200, 16, 16, "DAC None  ", BLUE);
	//     }

	//     if (t == 10)                                 /* 定时时间到了 */
	//     {
	//         LED0_TOGGLE();                           /* LED0闪烁 */
	//         t = 0;
	//     }

	//     delay_ms(10);
	// }

	/******************************************************
	DAC实验,通过按键控制输出电压，并且采集电压在显示器上显示
	*******************************************************/
	// adc_init();                             /* 初始化ADC */
	// dac_init(1);								/* 初始化DAC */
	// uint16_t adcx;
	// float temp;
	// uint16_t dacval = 0;

	// dac_set_voltage(1,3300); //1222

	// lcd_show_string(30, 30, 200, 32, 32, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "ADC TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "YSC@burningCloud", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "ADC1_CH0_VAL:", BLUE);
	// lcd_show_string(30, 130, 200, 16, 16, "ADC1_CH0_VOL:0.000V", BLUE); /* 先在固定位置显示小数点 */

	// while (1)
	// {
	// 	if (key1_scan())
	//     {
	//         if (dacval < 4000)dacval += 200;

	//         dac_set_voltage(2,dacval);/* 输出增大200 */
	// 		printf("PA5电压设置为%d\r\n",dacval);
	//     }
	//     else if (key2_scan())
	//     {
	//         if (dacval > 200)dacval -= 200;
	//         else dacval = 0;

	//         dac_set_voltage(2,dacval); /* 输出减少200 */
	// 		printf("PA5电压设置为%d\r\n",dacval);
	//     }
	// 	adcx = adc_get_result(); /* 获取通道0的转换值，10次取平均 */
	// 	lcd_show_xnum(134, 110, adcx, 5, 16, 0, BLUE);   /* 显示ADCC采样后的原始值 */

	// 	temp = (float)adcx * (3.3 / 4096);               /* 获取计算后的带小数的实际电压值，比如3.1111 */
	// 	adcx = temp;                                     /* 赋值整数部分给adcx变量，因为adcx为u16整形 */
	// 	lcd_show_xnum(134, 130, adcx, 1, 16, 0, BLUE);   /* 显示电压值的整数部分，3.1111的话，这里就是显示3 */

	// 	temp -= adcx;                                    /* 把已经显示的整数部分去掉，留下小数部分，比如3.1111-3=0.1111 */
	// 	temp *= 1000;                                    /* 小数部分乘以1000，例如：0.1111就转换为111.1，相当于保留三位小数。 */
	// 	lcd_show_xnum(150, 130, temp, 3, 16, 0X80, BLUE);/* 显示小数部分（前面转换为了整形显示），这里显示的就是111. */

	// 	showtime();

	// 	LED0_TOGGLE();
	// 	delay_ms(100);
	// }

	// 内部温度传感器实验
	//  short temp;
	//  adc_temperature_init();                     /* 初始化ADC内部温度传感器采集 */

	// lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30,  70, 200, 16, 16, "Temperature TEST", RED);
	// lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 120, 200, 16, 16, "TEMPERATE: 00.00C", BLUE);

	// while (1)
	// {

	//     temp = adc_get_temperature();   /* 得到温度值 */

	//     if (temp < 0)
	//     {
	//         temp = -temp;
	//         lcd_show_string(30 + 10 * 8, 120, 16, 16, 16, "-", BLUE);   /* 显示负号 */
	//     }
	//     else
	//     {
	//         lcd_show_string(30 + 10 * 8, 120, 16, 16, 16, " ", BLUE);   /* 无符号 */
	//     }
	//     lcd_show_xnum(30 + 11 * 8, 120, temp / 100, 2, 16, 0, BLUE);    /* 显示整数部分 */
	//     lcd_show_xnum(30 + 14 * 8, 120, temp % 100, 2, 16, 0X80, BLUE); /* 显示小数部分 */

	// 	showtime();	//显示时间
	//     LED0_TOGGLE();  /* LED0闪烁,提示程序运行 */
	//     delay_ms(250);
	// }

	// 单通道ADC过采样（12转16分辨率）
	/* ADC过采样技术, 是利用ADC多次采集的方式, 来提高ADC精度, 采样速度每提高4倍
	 * 采样精度提高 1bit, 同时, ADC采样速度降低4倍, 如提高4bit精度, 需要256次采集
	 * 才能得出1次数据, 相当于ADC速度慢了256倍. 理论上只要ADC足够快, 我们可以无限
	 * 提高ADC精度, 但实际上ADC并不是无限快的, 而且由于ADC性能限制, 并不是位数无限
	 * 提高结果就越好, 需要根据自己的实际需求和ADC的实际性能来权衡.
	 */

	// 	uint16_t i;
	// 	uint32_t adcx;
	// 	uint32_t sum;
	// 	float temp;

	// 	adc_over_dma_init((uint32_t)&g_adc_dma_buf);     			/* 初始化ADC DMA采集 */

	// 	lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
	// 	lcd_show_string(30,  70, 200, 16, 16, "ADC OverSample TEST", RED);
	// 	lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// 	lcd_show_string(30, 110, 200, 16, 16, "ADC1_CH1_VAL:", BLUE);
	// 	lcd_show_string(30, 130, 200, 16, 16, "ADC1_CH1_VOL:0.000V", BLUE); /* 先在固定位置显示小数点 */

	//    adc_dma_enable(ADC_DMA_BUF_SIZE);           /* 启动ADC DMA采集 */

	// 	while (1)
	// 	{
	// 		if (g_adc_dma_sta == 1)
	// 		{
	//            /* 计算DMA 采集到的ADC数据的平均值 */
	// 			sum = 0;

	//            for (i = 0; i < ADC_DMA_BUF_SIZE; i++)   /* 累加 */
	// 			{
	// 			sum += g_adc_dma_buf[i];
	// 			}

	//            adcx = sum / (ADC_DMA_BUF_SIZE / ADC_OVERSAMPLE_TIMES); /* 取平均值 */
	//            adcx >>= 4;   /* 除以2^4倍, 得到12+4位 ADC精度值, 注意: 提高 N bit精度, 需要 >> N */

	//            /* 显示结果 */
	//            lcd_show_xnum(134, 110, adcx, 5, 16, 0, BLUE);      /* 显示ADCC采样后的原始值 */

	//            temp = (float)adcx * (3.3 / 65536);                 /* 获取计算后的带小数的实际电压值，比如3.1111 */
	//            adcx = temp;                                        /* 赋值整数部分给adcx变量，因为adcx为u16整形 */
	//            lcd_show_xnum(134, 130, adcx, 1, 16, 0, BLUE);      /* 显示电压值的整数部分，3.1111的话，这里就是显示3 */

	//            temp -= adcx;                                       /* 把已经显示的整数部分去掉，留下小数部分，比如3.1111-3=0.1111 */
	//            temp *= 1000;                                       /* 小数部分乘以1000，例如：0.1111就转换为111.1，相当于保留三位小数。 */
	//            lcd_show_xnum(150, 130, temp, 3, 16, 0X80, BLUE);   /* 显示小数部分（前面转换为了整形显示），这里显示的就是111. */

	//            g_adc_dma_sta = 0;                                  /* 清除DMA采集完成状态标志 */
	//            adc_dma_enable(ADC_DMA_BUF_SIZE);                   /* 启动下一次ADC DMA采集 */
	// 		}

